export default {
  theme: {
    light: 'Жарық',
    dark: 'Қараңғы'
  },
  page: {
    main: {
      intro: {
        title: '"Бастысы - идея мен амбиция"',
        name: 'Якуб'
      },
      header: {
        my_training: 'Менің оқуым',
        all_courses: 'Барлық курстар',
        contacts: 'Байланыстар',
        team: 'Команда',
        about: "'Gasyr Lab' туралы",
        dropdown: {
          log_out: 'Шығу'
        },
        login: 'Кіру',
        register: 'Тіркелу'
      },
      main: {
        scrollHorizontal: {
          title: 'Демеушілер'
        },
        greetingSection: {
          title: 'Сапа мен қолжетімділікке негізделген ғасырға сай білім беретін онлайн IT мектебі',
          subtitle: 'Компаниялар біздің түлектерді өздері күтеді'
        },
        ourCourses: {
          title: 'Бағыттар мен Курстар',
          courses: {
            pythonDesc:
              'Бұл күрделі алгоритмдерді шеберлікпен өмірге әкелетін цифрлық әлемнің сәулетшілері. Бұл сарапшылар теорияны функционалды шындыққа айналдыру арқылы өздерінің сиқырларын жасайды.',
            javaDesc:
              'Бұл серверде, яғни қолданбаларға немесе веб-сайттарға қызмет көрсететін компьютерде жұмыс істейтін қолданбалардың бөлігінің сәулетшілері мен құрастырушылары сияқты.',
            cppDesc:
              'Бұл C++ курсында сіз серверлік қосымшалар үшін қажетті функционалдылық пен өнімділікті қамтамасыз ететін сенімді және тиімді құрамдастарды қалай жасау керектігін үйренесіз.'
          }
        },
        subscription: {
          title: 'Таңдаумен көмектесеміз',
          desc: 'Егер сізде формат туралы сұрақтарыңыз болса немесе не таңдау керектігін білмесеңіз, нөміріңізді қалдырыңыз - біз қоңырау шалып, барлық сұрақтарға жауап береміз',
          inputName: 'Есімі',
          inputSurname: 'Тегі',
          rules:
            'Нысанды жіберу арқылы сіз “Дербес деректерді өңдеу туралы келісімді" және "Оферта" шарттарын қабылдау, сондай-ақ "Пайдаланушы шарттары" бойынша келісіміңізді бересіз'
        }
      },
      footer: {
        newsletter: {
          title: 'Барлығы туралы хабардар болу үшін біздің ақпараттық бюллетеньге жазылыңыз!',
          desc: 'Біздің саладағы барлық оқиғалардан хабардар болыңыз және маңызды бөлшектерді жіберіп алмаңыз. Дәл қазір біздің ақпараттық ортаға қосылыңыз және болып жатқан оқиғалардың ортасында болыңыз!'
        },
        list: {
          aboutUs: {
            title: 'Біз жайлы',
            school: 'Мектеп',
            java: '"Java" жайлы Курс',
            python: '"Python" жайлы Курс',
            cpp: '"C++" жайлы Курс'
          },
          help: {
            title: 'Көмек',
            ref: 'Анықтама',
            community: 'Қауымдастық',
            support: 'Техникалық көмек',
            faq: 'Сұрақ жән Жауап'
          },
          contacts: {
            title: 'Байланыстар',
            info: 'Ақпарат',
            address: 'Жандосов, 36'
          }
        }
      }
    },
    auth: {
      greetingSignIn: 'Қайта тіркелгендер!',
      greetingSignUp: 'Сәлем, достым!',
      textSignIn:
        'Барлық сайт функцияларын пайдалану үшін сіздің персоналдық маълуметерін енгізіңіз',
      textSignUp:
        'Барлық сайт функцияларын пайдалану үшін сіздің персоналдық маълуметерімен тіркелуді жасаңыз',

      login: {
        title: 'Кіру',
        inputEmail: 'Эл. Пошта',
        inputPassword: 'Құпия сөз',
        signIn: 'Кіру',
        errors: {
          requiredField: 'Міндетті түсінікті қолдану',
          existingPasswordAndEmail: 'Жазымызды емәйлі адресі мен паралі енгізіңіз'
        }
      },
      register: {
        title: 'Тіркелу',
        inputName: 'Аты',
        inputEmail: 'Электронды пошта',
        inputPassword: 'Құпия сөз',
        signUp: 'Тіркелу',
        errors: {
          requiredField: 'Міндетті өріс',
          minFieldLength: 'Ең аз 6 таңба',
          correctEmail: 'Дұрыс электрондық пошта мекенжайын енгізіңіз'
        }
      }
    },
    courses: {
      header: {},
      main: {
        course: [{}]
      },
      footer: {}
    }
    // ... another page texts
  },
  global: {
    btn: {
      default: 'Толығырақ',
      subscribe: 'Тіркелу',
      move: 'Өту',
      back: 'Артқа'
    }
  }
}
