import pythonSvg from '@/assets/images/courses/preview/python.svg'
import javaSvg from '@/assets/images/courses/preview/java.svg'
import dataAnalyticsSvg from '@/assets/images/courses/preview/dataAnalytics.svg'

export default {
  theme: {
    light: 'Жарық',
    dark: 'Қараңғы'
  },
  page: {
    main: {
      intro: {
        title: '"Бастысы - идея мен амбиция"',
        name: 'Якуб'
      },
      header: {
        my_training: 'Менің оқуым',
        all_courses: 'Барлық курстар',
        contacts: 'Байланыстар',
        team: 'Команда',
        about: "'Gasyr Lab' туралы",
        dropdown: {
          log_out: 'Шығу'
        },
        login: 'Кіру',
        register: 'Тіркелу'
      },
      main: {
        scrollHorizontal: {
          title: 'Демеушілер'
        },
        greetingSection: {
          title: 'Сапа мен қолжетімділікке негізделген ғасырға сай білім беретін онлайн IT мектебі',
          subtitle: 'Компаниялар біздің түлектерді өздері күтеді'
        },
        ourCourses: {
          title: 'Бағыттар мен Курстар',
          courses: [
            {
              preview: {
                title: 'Python',
                description:
                  'Біздің курс 30 сабақтан / 5 бөлімнен тұрады. Курстың соңына дейін портфолиоңызда 4 жоба. Мерзімі: 28 апта.',
                link: '#!',
                image: pythonSvg
              },
              detail: {
                id: 1,
                title: 'Python',
                fullMounth: 6,
                description:
                  'Python үйрену оңай, тіпті сіз ешқашан бағдарламаламасаңыз да. Тренинг кезінде сізге тәжірибелі тәлімгер көмектеседі. Сіз 3 портфолио жобасын әзірлейсіз, ал Мансап орталығы сізге Python әзірлеушісі ретінде жұмыс табуға көмектеседі.',
                headerCircle: ['Онлайн', 'Басталуы: 6 мамыр'],
                aboutProfession: {
                  description:
                    'Python — бастаушы үшін тамаша тіл. Python кодын жазу және оқу оңай, тіл танымалдылық рейтингінде үнемі жоғары орын алады, ал «Питонистер» АТ-ның барлық дерлік салаларында сұранысқа ие - бағдарламалау, деректерді талдау, жүйені басқару және тестілеу. YouTube, Intel, Pixar, NASA, VK, Yandex - өз өнімдерінде Python қолданатын белгілі компаниялардың бірнешеуі ғана.',
                  salary: '400 000'
                },
                conversationCourse: {
                  allProjects: 3,
                  accordionData: [
                    {
                      id: 1,
                      title: 'Python Негіздері. 1-Бөлім',
                      accordionList: [
                        {
                          title: 'Кірісіпе'
                        },
                        {
                          title: 'Python-мен жұмыс негіздері'
                        },
                        {
                          title: 'Операторлар, өрнектер'
                        }
                      ]
                    },
                    {
                      id: 2,
                      title: 'Python негіздері. 2-бөлім: Telegram үшін чат-бот',
                      accordionList: [
                        {
                          title: 'IDE орнату және конфигурациялау'
                        },
                        {
                          title: 'Негізгі жинақтар. Тізімдер'
                        },
                        {
                          title: 'List: тізімдермен жұмыс істеу әдістері'
                        }
                      ]
                    },
                    {
                      id: 3,
                      title: 'Python-фреймворк Django',
                      accordionList: [
                        {
                          title: 'Веб-фреймворки кіріспесі'
                        },
                        {
                          title: 'Введение в Django'
                        },
                        {
                          title: 'Введение в веб и Linux'
                        },
                        {
                          title: 'База данных и модели'
                        }
                      ]
                    },
                    {
                      id: 4,
                      title: 'Командный проект: создание маркетплейса',
                      accordionList: [
                        {
                          title:
                            'Вместе с тимлидом и командой из 3–5 человек вы разработаете серверную часть для полноценного маркетплейса. Вы будете работать по системе Scrum или Kanban, регулярно обсуждать с тимлидом текущий прогресс и получать новые задачи. Все процессы максимально приближены к реальным условиям — именно так создают коммерческий софт в компаниях-работодателях. В результате вы создадите собственный аналог «Яндекс Маркета».'
                        }
                      ]
                    },
                    {
                      id: 5,
                      title: 'Python Advanced: социальная сеть',
                      accordionList: [
                        {
                          title: 'Flask: начало'
                        },
                        {
                          title: 'Основы работы в Linux. Часть 1'
                        }
                      ]
                    }
                  ]
                },
                tarifs: {
                  standart: {
                    listData: [
                      '3  проекта в портфолио',
                      'Карьерный трек',
                      'Гарантия трудоустройства',
                      'Бессрочный доступ к учебным материалам',
                      'Комплексная подготовка',
                      'Профориентация'
                    ]
                  },
                  ultimate: {
                    listData: [
                      '3  проекта в портфолио',
                      'Карьерный трек',
                      'Гарантия трудоустройства',
                      'Бессрочный доступ к учебным материалам',
                      'Комплексная подготовка',
                      'Профориентация',
                      'Персональное расписание',
                      'Индивидуальная траектория обучения',
                      '80 часов персональных консультаций с наставником'
                    ]
                  }
                }
              }
            },
            {
              preview: {
                title: 'Java',
                description:
                  'Наш курс состоит из 30 уроков/ 5 частей. До окончание курса 4 проекта в ваше портфолио. Длительность: 28 недель. ',
                link: '#!',
                image: javaSvg
              },
              detail: {
                id: 2,
                title: 'Java',
                fullMounth: 6,
                description:
                  'Python просто выучить, даже если вы никогда не программировали. Во время обучения вам будет помогать эксперт-куратор. Вы разработаете 3 проекта для портфолио, а Центр карьеры поможет найти работу Python-разработчиком.',
                headerCircle: ['Онлайн', 'Старт: 6 мая'],
                aboutProfession: {
                  description:
                    'Python — идеальный язык для новичка. Код на Python легко писать и читать, язык стабильно занимает высокие места в рейтингах популярности, а «питонисты» востребованы почти во всех сферах IT — программировании, анализе данных, системном администрировании и тестировании. YouTube, Intel, Pixar, NASA, VK, Яндекс — вот лишь немногие из известных компаний, которые используют Python в своих продуктах.',
                  salary: '400 000'
                },
                conversationCourse: {
                  allProjects: 3,
                  accordionData: [
                    {
                      id: 1,
                      title: 'Основы Python. Часть 1',
                      accordionList: [
                        {
                          title: 'Введение'
                        },
                        {
                          title: 'Основы работы с Python'
                        },
                        {
                          title: 'Операторы, выражения'
                        }
                      ]
                    },
                    {
                      id: 2,
                      title: 'Основы Python. Часть 2: чат-бот для Telegram',
                      accordionList: [
                        {
                          title: 'Установка и настройка IDE'
                        },
                        {
                          title: 'Базовые коллекции. Списки'
                        },
                        {
                          title: 'List: методы работы со списками'
                        }
                      ]
                    },
                    {
                      id: 3,
                      title: 'Python-фреймворк Django',
                      accordionList: [
                        {
                          title: 'Введение в веб-фреймворки'
                        },
                        {
                          title: 'Введение в Django'
                        },
                        {
                          title: 'Введение в веб и Linux'
                        },
                        {
                          title: 'База данных и модели'
                        }
                      ]
                    },
                    {
                      id: 4,
                      title: 'Командный проект: создание маркетплейса',
                      accordionList: [
                        {
                          title:
                            'Вместе с тимлидом и командой из 3–5 человек вы разработаете серверную часть для полноценного маркетплейса. Вы будете работать по системе Scrum или Kanban, регулярно обсуждать с тимлидом текущий прогресс и получать новые задачи. Все процессы максимально приближены к реальным условиям — именно так создают коммерческий софт в компаниях-работодателях. В результате вы создадите собственный аналог «Яндекс Маркета».'
                        }
                      ]
                    },
                    {
                      id: 5,
                      title: 'Python Advanced: социальная сеть',
                      accordionList: [
                        {
                          title: 'Flask: начало'
                        },
                        {
                          title: 'Основы работы в Linux. Часть 1'
                        }
                      ]
                    }
                  ]
                },
                tarifs: {
                  standart: {
                    listData: [
                      '3  проекта в портфолио',
                      'Карьерный трек',
                      'Гарантия трудоустройства',
                      'Бессрочный доступ к учебным материалам',
                      'Комплексная подготовка',
                      'Профориентация'
                    ]
                  },
                  ultimate: {
                    listData: [
                      '3  проекта в портфолио',
                      'Карьерный трек',
                      'Гарантия трудоустройства',
                      'Бессрочный доступ к учебным материалам',
                      'Комплексная подготовка',
                      'Профориентация',
                      'Персональное расписание',
                      'Индивидуальная траектория обучения',
                      '80 часов персональных консультаций с наставником'
                    ]
                  }
                }
              }
            },
            {
              preview: {
                title: 'Data Analytics',
                description:
                  'Наш курс состоит из 30 уроков/ 5 частей. До окончание курса 4 проекта в ваше портфолио. Длительность: 28 недель. ',
                link: '#!',
                image: dataAnalyticsSvg
              },
              detail: {
                id: 3,
                title: 'Data Analytics',
                fullMounth: 6,
                description:
                  'Python просто выучить, даже если вы никогда не программировали. Во время обучения вам будет помогать эксперт-куратор. Вы разработаете 3 проекта для портфолио, а Центр карьеры поможет найти работу Python-разработчиком.',
                headerCircle: ['Онлайн', 'Старт: 6 мая'],
                aboutProfession: {
                  description:
                    'Python — идеальный язык для новичка. Код на Python легко писать и читать, язык стабильно занимает высокие места в рейтингах популярности, а «питонисты» востребованы почти во всех сферах IT — программировании, анализе данных, системном администрировании и тестировании. YouTube, Intel, Pixar, NASA, VK, Яндекс — вот лишь немногие из известных компаний, которые используют Python в своих продуктах.',
                  salary: '400 000'
                },
                conversationCourse: {
                  allProjects: 3,
                  accordionData: [
                    {
                      id: 1,
                      title: 'Основы Python. Часть 1',
                      accordionList: [
                        {
                          title: 'Введение'
                        },
                        {
                          title: 'Основы работы с Python'
                        },
                        {
                          title: 'Операторы, выражения'
                        }
                      ]
                    },
                    {
                      id: 2,
                      title: 'Основы Python. Часть 2: чат-бот для Telegram',
                      accordionList: [
                        {
                          title: 'Установка и настройка IDE'
                        },
                        {
                          title: 'Базовые коллекции. Списки'
                        },
                        {
                          title: 'List: методы работы со списками'
                        }
                      ]
                    },
                    {
                      id: 3,
                      title: 'Python-фреймворк Django',
                      accordionList: [
                        {
                          title: 'Введение в веб-фреймворки'
                        },
                        {
                          title: 'Введение в Django'
                        },
                        {
                          title: 'Введение в веб и Linux'
                        },
                        {
                          title: 'База данных и модели'
                        }
                      ]
                    },
                    {
                      id: 4,
                      title: 'Командный проект: создание маркетплейса',
                      accordionList: [
                        {
                          title:
                            'Вместе с тимлидом и командой из 3–5 человек вы разработаете серверную часть для полноценного маркетплейса. Вы будете работать по системе Scrum или Kanban, регулярно обсуждать с тимлидом текущий прогресс и получать новые задачи. Все процессы максимально приближены к реальным условиям — именно так создают коммерческий софт в компаниях-работодателях. В результате вы создадите собственный аналог «Яндекс Маркета».'
                        }
                      ]
                    },
                    {
                      id: 5,
                      title: 'Python Advanced: социальная сеть',
                      accordionList: [
                        {
                          title: 'Flask: начало'
                        },
                        {
                          title: 'Основы работы в Linux. Часть 1'
                        }
                      ]
                    }
                  ]
                },
                tarifs: {
                  standart: {
                    listData: [
                      '3  проекта в портфолио',
                      'Карьерный трек',
                      'Гарантия трудоустройства',
                      'Бессрочный доступ к учебным материалам',
                      'Комплексная подготовка',
                      'Профориентация'
                    ]
                  },
                  ultimate: {
                    listData: [
                      '3  проекта в портфолио',
                      'Карьерный трек',
                      'Гарантия трудоустройства',
                      'Бессрочный доступ к учебным материалам',
                      'Комплексная подготовка',
                      'Профориентация',
                      'Персональное расписание',
                      'Индивидуальная траектория обучения',
                      '80 часов персональных консультаций с наставником'
                    ]
                  }
                }
              }
            }
          ]
        },
        subscription: {
          title: 'Таңдаумен көмектесеміз',
          desc: 'Егер сізде формат туралы сұрақтарыңыз болса немесе не таңдау керектігін білмесеңіз, нөміріңізді қалдырыңыз - біз қоңырау шалып, барлық сұрақтарға жауап береміз',
          inputName: 'Есімі',
          inputSurname: 'Тегі',
          rules:
            'Нысанды жіберу арқылы сіз “Дербес деректерді өңдеу туралы келісімді" және "Оферта" шарттарын қабылдау, сондай-ақ "Пайдаланушы шарттары" бойынша келісіміңізді бересіз'
        }
      },
      footer: {
        newsletter: {
          title: 'Барлығы туралы хабардар болу үшін біздің ақпараттық бюллетеньге жазылыңыз!',
          desc: 'Біздің саладағы барлық оқиғалардан хабардар болыңыз және маңызды бөлшектерді жіберіп алмаңыз. Дәл қазір біздің ақпараттық ортаға қосылыңыз және болып жатқан оқиғалардың ортасында болыңыз!'
        },
        list: {
          aboutUs: {
            title: 'Біз жайлы',
            school: 'Мектеп',
            java: '"Java" жайлы Курс',
            python: '"Python" жайлы Курс',
            dataAnalytics: '"Data Analytics" жайлы Курс'
          },
          help: {
            title: 'Көмек',
            ref: 'Анықтама',
            community: 'Қауымдастық',
            support: 'Техникалық көмек',
            faq: 'Сұрақ жән Жауап'
          },
          contacts: {
            title: 'Байланыстар',
            info: 'Ақпарат',
            address: 'Жандосов, 36'
          }
        }
      }
    },
    auth: {
      greetingSignIn: 'Қайта тіркелгендер!',
      greetingSignUp: 'Сәлем, достым!',
      textSignIn:
        'Барлық сайт функцияларын пайдалану үшін сіздің персоналдық маълуметерін енгізіңіз',
      textSignUp:
        'Барлық сайт функцияларын пайдалану үшін сіздің персоналдық маълуметерімен тіркелуді жасаңыз',

      login: {
        title: 'Кіру',
        inputEmail: 'Эл. Пошта',
        inputPassword: 'Құпия сөз',
        signIn: 'Кіру',
        errors: {
          requiredField: 'Міндетті түсінікті қолдану',
          existingPasswordAndEmail: 'Жазымызды емәйлі адресі мен паралі енгізіңіз'
        }
      },
      register: {
        title: 'Тіркелу',
        inputName: 'Аты',
        inputEmail: 'Электронды пошта',
        inputPassword: 'Құпия сөз',
        signUp: 'Тіркелу',
        errors: {
          requiredField: 'Міндетті өріс',
          minFieldLength: 'Ең аз 6 таңба',
          correctEmail: 'Дұрыс электрондық пошта мекенжайын енгізіңіз'
        }
      }
    },
    global: {
      btn: {
        default: 'Толығырақ',
        subscribe: 'Тіркелу',
        move: 'Өту',
        back: 'Артқа'
      }
    }
  }
}
