export default [
	{
		id: 1,
		bgColor: '#ffdf6e',
		title: 'Резюме',
		description: 'Презентуем вас работодателем с выгодной стороны',
		hoverDescription: 'Проведём онлайн-встречу, где оценим ваши сильные стороны, навыки и профессиональный опыт. Поможем оформить профиль на сайтах с вакансиями и разработать привлекательное резюме, которое точно впечатлит работодателей.'
	},
	{
		id: 2,
		bgColor: '#dcf4fe',
		title: 'Индивидуальный карьерный план',
		description: 'Расскажем, как начать и развивать карьеру',
		hoverDescription: 'Проведём онлайн-консультацию, определим ваши цели и расскажем, как их добиться. Сформируем индивидуальный путь вашего развития в профессии. Вы узнаете, где искать работу и какие навыки развивать, чтобы продвинуться в карьере.'
	},
	{
		id: 3,
		bgColor: '#afdfb4',
		title: 'Партнерские вакансии',
		description: 'Порекомендуем вашу кандидатуру партнёрам',
		hoverDescription: 'У вас будет доступ к закрытому чату с вакансиями наших партнёров. Вы сможете выбрать подходящие предложения, а консультант поможет написать сопроводительное письмо и подготовиться к собеседованию. Вашу кандидатуру рассмотрят в числе первых.'
	},
	{
		id: 4,
		bgColor: '#febcb4',
		title: 'Оформление портфолио',
		description: 'Поможем эффектно представить ваши проекты',
		hoverDescription: 'Расскажем, как создать продающее портфолио. Вместе выберем привлекательные работы и отдадим на ревью эксперту. Поможем оформить проекты так, что их по достоинству оценят работодатели.'
	},
]